#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.staging_plancraftr_com: Refreshing state... [id=staging.plancraftr.com]
aws_s3_bucket.www_staging_plancraftr_com: Refreshing state... [id=www.staging.plancraftr.com]
aws_security_group.staging_server_plancraftr_sg: Refreshing state... [id=sg-0333dcd0f775359e6]
aws_instance.staging_server_plancraftr: Refreshing state... [id=i-05f2f2f34743864e1]
aws_route53_record.staging_api_plancraftr: Refreshing state... [id=Z097947118UN4SFV6P8TX_staging.api.plancraftr.com_A]
aws_s3_bucket_website_configuration.static_website_config_s3_staging: Refreshing state... [id=staging.plancraftr.com]
aws_cloudfront_distribution.staging_distribution: Refreshing state... [id=E1ORN83BZ9AKC8]
aws_s3_bucket_public_access_block.allow_public_access_s3_www_staging: Refreshing state... [id=www.staging.plancraftr.com]
aws_s3_bucket_website_configuration.static_website_config_s3_www_staging: Refreshing state... [id=www.staging.plancraftr.com]
aws_cloudfront_distribution.www_staging_distribution: Refreshing state... [id=E1DRSGHP6PB0H7]
aws_route53_record.www_staging_plancraftr: Refreshing state... [id=Z097947118UN4SFV6P8TX_www.staging.plancraftr.com_A]
aws_route53_record.staging_plancraftr: Refreshing state... [id=Z097947118UN4SFV6P8TX_staging.plancraftr.com_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_cloudfront_distribution.staging_distribution has been deleted
  - resource "aws_cloudfront_distribution" "staging_distribution" {
      - domain_name                    = "d11llohk9uqkg2.cloudfront.net" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
        id                             = "E1ORN83BZ9AKC8"
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_cloudfront_distribution.www_staging_distribution has been deleted
  - resource "aws_cloudfront_distribution" "www_staging_distribution" {
      - domain_name                    = "d1otdu6z1qlww7.cloudfront.net" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
        id                             = "E1DRSGHP6PB0H7"
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.staging_distribution will be created
  + resource "aws_cloudfront_distribution" "staging_distribution" {
      + aliases                         = [
          + "staging.plancraftr.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = true
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "staging_s3_origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "staging.plancraftr.com.s3.ap-southeast-1.amazonaws.com"
          + origin_id           = "staging_s3_origin"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:084828604403:certificate/59114432-b5de-4dcd-b632-18ce0761e813"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_distribution.www_staging_distribution will be created
  + resource "aws_cloudfront_distribution" "www_staging_distribution" {
      + aliases                         = [
          + "www.staging.plancraftr.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = true
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "www_staging_s3_origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "www.staging.plancraftr.com.s3.ap-southeast-1.amazonaws.com"
          + origin_id           = "www_staging_s3_origin"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:084828604403:certificate/59114432-b5de-4dcd-b632-18ce0761e813"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_route53_record.staging_plancraftr will be updated in-place
  ~ resource "aws_route53_record" "staging_plancraftr" {
        id                               = "Z097947118UN4SFV6P8TX_staging.plancraftr.com_A"
        name                             = "staging.plancraftr.com"
        # (6 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "s3-website-ap-southeast-1.amazonaws.com" -> (known after apply)
          ~ zone_id                = "Z3O0J2DXBE1FTB" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_route53_record.www_staging_plancraftr will be updated in-place
  ~ resource "aws_route53_record" "www_staging_plancraftr" {
        id                               = "Z097947118UN4SFV6P8TX_www.staging.plancraftr.com_A"
        name                             = "www.staging.plancraftr.com"
        # (6 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "s3-website-ap-southeast-1.amazonaws.com" -> (known after apply)
          ~ zone_id                = "Z3O0J2DXBE1FTB" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket_policy.allow_anyone_get_objects_s3_www_staging will be created
  + resource "aws_s3_bucket_policy" "allow_anyone_get_objects_s3_www_staging" {
      + bucket = "www.staging.plancraftr.com"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "PlancraftrS3AccessPolicy"
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                          + "s3:PutBucketPolicy",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::www.staging.plancraftr.com/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @hasangawr, Action: `pull_request`*